---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SkylightFailures.MinSkylightWidthImperial
source: html/e8b38785-9a92-b050-f7aa-ba2fee20821b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SkylightFailures.MinSkylightWidthImperial Property

The minimum skylight width is 8 inches.

## Syntax (C#)
```csharp
public static FailureDefinitionId MinSkylightWidthImperial { get; }
```